<?php

/**
 *  选择排序
 *　原理： 在一列数字中，选出最小数与第一个位置的数交换。然后在剩下的数当中再找最小的与第二个位置的数交换，
 *        如此循环到倒数第二个数和最后一个数比较为止。(以下都是升序排列，即从小到大排列)
 */



function SelectSort($arr){
    //定义中间变量
    $temp = 0;
    $count = count($arr);
    for($i=0; $i<$count-1; $i++){
        //定义最小位置
        $minIndex = $i;
        for($j= $i+1; $j<$count; $j++){
            if($arr[$j] < $arr[$minIndex]){
                $minIndex = $j;
            }
        }
        if($i != $minIndex){
            $temp = $arr[$i];
            $arr[$i] = $arr[$minIndex];
            $arr[$minIndex] = $temp;

        }
    }
    return $arr;
}

// +--------------------------------------------------------------------------
// | 方案测试
// +--------------------------------------------------------------------------


var_dump(SelectSort([3, 12, 42, 1, 24, 5, 346, 7]));

/*
 array(8) {
  [0] =>
  int(1)
  [1] =>
  int(3)
  [2] =>
  int(5)
  [3] =>
  int(7)
  [4] =>
  int(12)
  [5] =>
  int(24)
  [6] =>
  int(42)
  [7] =>
  int(346)
}
 */